driver-tests/bpelse/xsddatatypes/XSDDataTypesBpel/src/ReplacementLogic_for_Copy/xsddatatype_specexample1.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" 
		xmlns:slnk="http://schemas.xmlsoap.org/ws/2002/07/service-link/" 
		xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
		xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
		name="xsddatatype_specexample1Wsdl" 
		targetNamespace="http://sun.com/bpel/xsddatatype_specexample1Wsdl"
		xmlns:tns="http://sun.com/bpel/xsddatatype_specexample1Wsdl" 
                xmlns:ns0="http://localhost/person">

    <import location="person.xsd" namespace="http://localhost/person"/>                    
    <message name="message">
        <part element="ns0:person" name="part"/>
    </message>
    <portType name="xsddatatype_specexample1PortType">
        <operation name="operation1">
            <input message="tns:message"/>
            <output message="tns:message"/>
        </operation>
    </portType>
    <binding name="xsddatatype_specexample1Binding" type="tns:xsddatatype_specexample1PortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="operation1">
            <soap:operation soapAction="xsddatatype_specexample1"/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="xsddatatype_specexample1Service">
        <port binding="tns:xsddatatype_specexample1Binding" name="xsddatatype_specexample1Port">
            <soap:address location="http://localhost:${HttpDefaultPort}/service/xsddatatype_specexample1"/>
        </port>
    </service>
    <plnk:partnerLinkType xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" name="xsddatatype_specexample1PLT">
        <plnk:role name="server" portType="tns:xsddatatype_specexample1PortType"/>
    </plnk:partnerLinkType>
</definitions>
