driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/results/ReplacementLogic_for_Copy_ElemToElem1/Actual_20130311131751_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <person xmlns="http://localhost/person" xmlns:msgns="http://sun.com/bpel/xsddatatype_specexample1Wsdl">
      <work xmlns:per="http://localhost/person" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
                <per:name>John Doe</per:name>
                <per:street>Royal Oaks</per:street>
                <per:city>Monrovia</per:city>
                <per:state>CA</per:state>
                <per:zip>91016</per:zip>
            </work>
    </person>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>