driver-tests/bpelse/assign/AssignJbi/test/SpecExampleTextToText/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                    xmlns:per="http://localhost/person">
  <soapenv:Body>
    <per:person name="JohnDoe">
        <per:testType>TextToText</per:testType>
        <per:birthdate>
            <per:month>January</per:month>
            <per:day>21</per:day>
            <per:year>1983</per:year>
        </per:birthdate>
	<per:home>
		<per:name>John Doe</per:name>
		<per:street>Royal Oaks</per:street>
		<per:city>Monrovia</per:city>
		<per:state>CA</per:state>
		<per:zip>91016</per:zip>
	</per:home>
	<per:work>
		<per:name>John Doe</per:name>
		<per:street>Higland Oaks</per:street>
		<per:city>Duarte</per:city>
		<per:state>CA</per:state>
		<per:zip>91010</per:zip>
	</per:work>        
    </per:person>
  </soapenv:Body>
</soapenv:Envelope>